ams/src/Catalogs/ДатаМобайл_ДокументыТСД_ЕГАИС/ДатаМобайл_ДокументыТСД_ЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДатаМобайл_ДокументыТСД_ЕГАИС</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияСбора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияКлиента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСбора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемкиОператором</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЧекККМ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовыйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланРавноФакт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостановкаНаКарантин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаИзображение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТСД</name>
    <type>
      <types>ExchangePlanRef.ДатаМобайл_СписокТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ДатаМобайл_ШаблоныДокументов_ЕГАИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СобранныеДанныеПодбор</name>
    <attributes>
      <name>PDF</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>19</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕгаисДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕгаисМарка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕгаисПолныйКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕгаисСправкаА</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕгаисСправкаБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТовараЕГАИС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Короб</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоваяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураЕГАИС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Палета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияСсылка</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаИзображение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТСД</name>
      <type>
        <types>ExchangePlanRef.ДатаМобайл_СписокТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковочныйЛист</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокТерминалов</name>
    <attributes>
      <name>ТСД</name>
      <type>
        <types>ExchangePlanRef.ДатаМобайл_СписокТСД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/Catalogs/ДатаМобайл_ДокументыТСД_ЕГАИС/Forms/ФормаЭлементаУправляемая/Module.bsl
&НаКлиенте
Перем ВключенаГрупповаяРабота;

&НаСервереБезКонтекста
Функция ПолучитьПустыеСсылки(лШаблон)
	Ответ=Новый Структура("Старый,Новый,Создавать");
	Ответ.Старый=Документы[лШаблон.ВидДокумента].Пустаяссылка();
	Ответ.Новый=Ответ.Старый;
	Если СокрЛП(лШаблон.ВидДокументаНового)<>"" тогда
		Ответ.Новый=Документы[лШаблон.ВидДокументаНового].Пустаяссылка();
		Ответ.Создавать=Истина;
	Иначе	
		Ответ.Создавать=Ложь;
	КонецЕсли;	
	Возврат Ответ;
КонецФункции	

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	Элементы.ИсходныйДокумент.ТолькоПросмотр=Объект.Шаблон.Пустая(); 
	ВключенаГрупповаяРабота = РеквизитГрупповаяРабота(Объект.Шаблон);
	ИзменитьВидимостьВкладокПодборРазмещение();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ИсходныйДокумент=Неопределено тогда
		Если Не Объект.Шаблон.Пустая() тогда
			Объект.ИсходныйДокумент=Документы[Объект.Шаблон.ВидДокумента].Пустаяссылка();
		КонецЕсли;	
	КонецЕсли;	
	Если СокрЛП(Объект.Шаблон.ВидДокументаНового)="" тогда//старая схема
		Элементы.НовыйДокумент.ТолькоПросмотр=Истина;
	Иначе	
		Элементы.НовыйДокумент.ТолькоПросмотр=Ложь;
		Если Объект.НовыйДокумент=Неопределено тогда
			Если Не Объект.Шаблон.Пустая() тогда
				Объект.НовыйДокумент=Документы[Объект.Шаблон.ВидДокументаНового].Пустаяссылка();
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	ОграничениеТипаРеквизита();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент) 
	
	Если Не Объект.Шаблон.Пустая() тогда
		ПустыеСсылки=ПолучитьПустыеСсылки(Объект.Шаблон);
		Если ТипЗнч(Объект.ИсходныйДокумент)<>ТипЗнч(ПустыеСсылки.Старый) тогда
			Объект.ИсходныйДокумент=ПустыеСсылки.Старый;
			Элементы.ИсходныйДокумент.ВыбиратьТип=Ложь;
		КонецЕсли;	
		Если ТипЗнч(Объект.НовыйДокумент)<>ТипЗнч(ПустыеСсылки.Новый) тогда
			Объект.НовыйДокумент=ПустыеСсылки.Новый;
			Элементы.НовыйДокумент.ВыбиратьТип=Ложь;
		КонецЕсли;	
		Элементы.НовыйДокумент.ТолькоПросмотр=Не ПустыеСсылки.Создавать;
	Иначе	
		Объект.ИсходныйДокумент=Неопределено;
		Объект.НовыйДокумент=Неопределено;
		Элементы.ИсходныйДокумент.ВыбиратьТип=Истина;
		Элементы.НовыйДокумент.ВыбиратьТип=Истина;
		Элементы.НовыйДокумент.ТолькоПросмотр=Ложь;
	КонецЕсли;	
	Элементы.ИсходныйДокумент.ТолькоПросмотр=Объект.Шаблон.Пустая(); 
	
	ВключенаГрупповаяРабота = РеквизитГрупповаяРабота(Объект.Шаблон);
	ИзменитьВидимостьВкладокПодборРазмещение();
	ОграничениеТипаРеквизита();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УжеЕсть(лСсылка,лИсходныйДокумент)
	Если лИсходныйДокумент<>Неопределено тогда
		Если не лИсходныйДокумент.Пустая() тогда
			Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДатаМобайл_ДокументыТСД.Ссылка
			|ИЗ
			|	Справочник.ДатаМобайл_ДокументыТСД_ЕГАИС КАК ДатаМобайл_ДокументыТСД
			|ГДЕ
			|	ДатаМобайл_ДокументыТСД.ИсходныйДокумент = &ИсходныйДокумент
			|	И ДатаМобайл_ДокументыТСД.Ссылка <> &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",лСсылка);
			Запрос.УстановитьПараметр("ИсходныйДокумент",лИсходныйДокумент);
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	Возврат Ложь;
КонецФункции

&НаКлиенте  
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если УжеЕсть(Объект.Ссылка,Объект.ИсходныйДокумент) тогда
		Если Не ПараметрыЗаписи.Свойство("ВопросЗадан") Тогда
			Отказ = Истина;
			Оповещение = Новый ОписаниеОповещения("ПоказатьВопросЗавершение", ЭтаФорма, ПараметрыЗаписи);
			ТекстВопроса = "Для документа "+Объект.ИсходныйДокумент+" уже создан документ ТСД. Продолжить?";
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросЗавершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("ВопросЗадан", Истина);
		
		Если Записать(ПараметрыЗаписи) Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область ВкладкиПодборРазмещениеГрупповаяРабота

//механизм переключения видимости вкладок.
&НаСервереБезКонтекста
Функция РеквизитГрупповаяРабота(Шаблон)
	
	Возврат Шаблон.ГрупповаяРабота;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьВидимостьВкладокПодборРазмещение()   
	
	Если ЗначениеЗаполнено(Объект.ДатаЗавершения) Тогда
		ВключенаГрупповаяРабота = Ложь;
	КонецЕсли;	
	
	//Элементы.ГрПодбор.Видимость = НЕ ВключенаГрупповаяРабота;
	Элементы.ГрПодборГрупповаяРабота.Видимость = ВключенаГрупповаяРабота; 
	
	УстановитьОтборыСписковСтрокГрупповойРаботы(ВключенаГрупповаяРабота);	              	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыСписковСтрокГрупповойРаботы(ВключенаГрупповаяРабота)
	
	Если ВключенаГрупповаяРабота Тогда
		СписокСтрокПодбораГрупповаяРабота.Параметры.УстановитьЗначениеПараметра("ДокументТСД", Объект.Ссылка);
	Иначе
		СписокСтрокПодбораГрупповаяРабота.Параметры.УстановитьЗначениеПараметра("ДокументТСД", Справочники.ДатаМобайл_ДокументыТСД.ПустаяСсылка());
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОграничениеТипаРеквизита()
	
	ВидДокумента = Объект.Шаблон.ВидДокумента;
	ВидДокументаНового = Объект.Шаблон.ВидДокументаНового;
	
	Если ЗначениеЗаполнено(ВидДокумента) Тогда
		Массив = Новый Массив(); 
		Массив.Добавить(Тип("ДокументСсылка." + ВидДокумента)); 
		НашеОписание = Новый ОписаниеТипов(Массив);
		
		Элементы.ИсходныйДокумент.ОграничениеТипа = НашеОписание;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидДокументаНового) Тогда
		Массив = Новый Массив(); 
		Массив.Добавить(Тип("ДокументСсылка." + ВидДокументаНового)); 
		НашеОписание = Новый ОписаниеТипов(Массив);
		
		Элементы.НовыйДокумент.ОграничениеТипа = НашеОписание;
	КонецЕсли;

КонецПроцедуры
